tests/load/load-test.yml
# Artillery load test config for Superagent — Closes #38
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:3000' }}"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: 'Warm up'
    - duration: 120
      arrivalRate: 20
      rampTo: 50
      name: 'Ramp up load'
    - duration: 60
      arrivalRate: 50
      name: 'Sustained load'
  ensure:
    thresholds:
      - http.response_time.p99: 2000
      - http.response_time.p95: 1000
    conditions:
      - expression: 'errors.rate < 0.05'

scenarios:
  - name: 'Health check'
    flow:
      - get:
          url: '/api/health'
          expect:
            - statusCode: 200

  - name: 'Pricing endpoint'
    flow:
      - get:
          url: '/api/pricing'
          expect:
            - statusCode:
                - 200
                - 404

  - name: 'Orchestrator status'
    flow:
      - get:
          url: '/api/orchestrator/status'
          expect:
            - statusCode:
                - 200
                - 404

  - name: 'SSE simulation (homepage)'
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: '/api/health'